phidiawang/Wisemay_CoolingFang_V2.0/src/S12ZVM_system/peripherals/mc9s12zvml32.h
#define ADC1EIF_LDOK_EIF_MASK           2U
#define ADC1EIF_RSTAR_EIF_MASK          4U
#define ADC1EIF_TRIG_EIF_MASK           8U
#define ADC1EIF_EOL_EIF_MASK            32U
#define ADC1EIF_CMD_EIF_MASK            64U
#define ADC1EIF_IA_EIF_MASK             128U


/*** ADC1IF - ADC1 Interrupt Flag Register; 0x00000649 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte CONIF_OIF   :1;                                       /* ADCxCONIF Register Flags Overrun Interrupt Flag */
    byte SEQAD_IF    :1;                                       /* Conversion Sequence Abort Done Interrupt Flag */
  } Bits;
} ADC1IFSTR;
extern volatile ADC1IFSTR _ADC1IF @0x00000649;
#define ADC1IF                          _ADC1IF.Byte
#define ADC1IF_CONIF_OIF                _ADC1IF.Bits.CONIF_OIF
#define ADC1IF_SEQAD_IF                 _ADC1IF.Bits.SEQAD_IF

#define ADC1IF_CONIF_OIF_MASK           64U
#define ADC1IF_SEQAD_IF_MASK            128U


/*** ADC1CONIE - ADC1 Conversion Interrupt Enable Register; 0x0000064A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ADC1CONIE_0 - ADC1 Conversion Interrupt Enable Register 0; 0x0000064A ***/
    union {
      byte Byte;
      struct {
        byte CON_IE8     :1;                                       /* Conversion Interrupt 8 Enable */
        byte CON_IE9     :1;                                       /* Conversion Interrupt 9 Enable */
        byte CON_IE10    :1;                                       /* Conversion Interrupt 10 Enable */
        byte CON_IE11    :1;                                       /* Conversion Interrupt 11 Enable */
        byte CON_IE12    :1;                                       /* Conversion Interrupt 12 Enable */
        byte CON_IE13    :1;                                       /* Conversion Interrupt 13 Enable */
        byte CON_IE14    :1;                                       /* Conversion Interrupt 14 Enable */
        byte CON_IE15    :1;                                       /* Conversion Interrupt 15 Enable */
      } Bits;
    } ADC1CONIE_0STR;
    #define ADC1CONIE_0                 _ADC1CONIE.Overlap_STR.ADC1CONIE_0STR.Byte
    #define ADC1CONIE_0_CON_IE8         _ADC1CONIE.Overlap_STR.ADC1CONIE_0STR.Bits.CON_IE8
    #define ADC1CONIE_0_CON_IE9         _ADC1CONIE.Overlap_STR.ADC1CONIE_0STR.Bits.CON_IE9
    #define ADC1CONIE_0_CON_IE10        _ADC1CONIE.Overlap_STR.ADC1CONIE_0STR.Bits.CON_IE10
    #define ADC1CONIE_0_CON_IE11        _ADC1CONIE.Overlap_STR.ADC1CONIE_0STR.Bits.CON_IE11
    #define ADC1CONIE_0_CON_IE12        _ADC1CONIE.Overlap_STR.ADC1CONIE_0STR.Bits.CON_IE12
    #define ADC1CONIE_0_CON_IE13        _ADC1CONIE.Overlap_STR.ADC1CONIE_0STR.Bits.CON_IE13
    #define ADC1CONIE_0_CON_IE14        _ADC1CONIE.Overlap_STR.ADC1CONIE_0STR.Bits.CON_IE14
    #define ADC1CONIE_0_CON_IE15        _ADC1CONIE.Overlap_STR.ADC1CONIE_0STR.Bits.CON_IE15
    /* ADC1CONIE__ARR: Access 2 ADC1CONIE_x registers in an array */
    #define ADC1CONIE__ARR              ((volatile byte *) &ADC1CONIE_0)
    
    #define ADC1CONIE_0_CON_IE8_MASK    1U
    #define ADC1CONIE_0_CON_IE9_MASK    2U
    #define ADC1CONIE_0_CON_IE10_MASK   4U
    #define ADC1CONIE_0_CON_IE11_MASK   8U
    #define ADC1CONIE_0_CON_IE12_MASK   16U
    #define ADC1CONIE_0_CON_IE13_MASK   32U
    #define ADC1CONIE_0_CON_IE14_MASK   64U
    #define ADC1CONIE_0_CON_IE15_MASK   128U
    

    /*** ADC1CONIE_1 - ADC1 Conversion Interrupt Enable Register 1; 0x0000064B ***/
    union {
      byte Byte;
      struct {
        byte EOL_IE      :1;                                       /* End Of List Interrupt Enable */
        byte CON_IE1     :1;                                       /* Conversion Interrupt 1 Enable */
        byte CON_IE2     :1;                                       /* Conversion Interrupt 2 Enable */
        byte CON_IE3     :1;                                       /* Conversion Interrupt 3 Enable */
        byte CON_IE4     :1;                                       /* Conversion Interrupt 4 Enable */
        byte CON_IE5     :1;                                       /* Conversion Interrupt 5 Enable */
        byte CON_IE6     :1;                                       /* Conversion Interrupt 6 Enable */
        byte CON_IE7     :1;                                       /* Conversion Interrupt 7 Enable */
      } Bits;
      struct {
        byte     :1;
        byte grpCON_IE_1 :7;
      } MergedBits;
    } ADC1CONIE_1STR;
    #define ADC1CONIE_1                 _ADC1CONIE.Overlap_STR.ADC1CONIE_1STR.Byte
    #define ADC1CONIE_1_EOL_IE          _ADC1CONIE.Overlap_STR.ADC1CONIE_1STR.Bits.EOL_IE
    #define ADC1CONIE_1_CON_IE1         _ADC1CONIE.Overlap_STR.ADC1CONIE_1STR.Bits.CON_IE1
    #define ADC1CONIE_1_CON_IE2         _ADC1CONIE.Overlap_STR.ADC1CONIE_1STR.Bits.CON_IE2
    #define ADC1CONIE_1_CON_IE3         _ADC1CONIE.Overlap_STR.ADC1CONIE_1STR.Bits.CON_IE3
    #define ADC1CONIE_1_CON_IE4         _ADC1CONIE.Overlap_STR.ADC1CONIE_1STR.Bits.CON_IE4
    #define ADC1CONIE_1_CON_IE5         _ADC1CONIE.Overlap_STR.ADC1CONIE_1STR.Bits.CON_IE5
    #define ADC1CONIE_1_CON_IE6         _ADC1CONIE.Overlap_STR.ADC1CONIE_1STR.Bits.CON_IE6
    #define ADC1CONIE_1_CON_IE7         _ADC1CONIE.Overlap_STR.ADC1CONIE_1STR.Bits.CON_IE7
    #define ADC1CONIE_1_CON_IE_1        _ADC1CONIE.Overlap_STR.ADC1CONIE_1STR.MergedBits.grpCON_IE_1
    #define ADC1CONIE_1_CON_IE          ADC1CONIE_1_CON_IE_1
    
    #define ADC1CONIE_1_EOL_IE_MASK     1U
    #define ADC1CONIE_1_CON_IE1_MASK    2U
    #define ADC1CONIE_1_CON_IE2_MASK    4U
    #define ADC1CONIE_1_CON_IE3_MASK    8U
    #define ADC1CONIE_1_CON_IE4_MASK    16U
    #define ADC1CONIE_1_CON_IE5_MASK    32U
    #define ADC1CONIE_1_CON_IE6_MASK    64U
    #define ADC1CONIE_1_CON_IE7_MASK    128U
    #define ADC1CONIE_1_CON_IE_1_MASK   254U
    #define ADC1CONIE_1_CON_IE_1_BITNUM 1U
    
  } Overlap_STR;

