phidiawang/Wisemay_CoolingFang_V2.0/src/S12ZVM_system/peripherals/mc9s12zvml32.h
    #define ADC1CONIF_1_EOL_IF_MASK     1U
    #define ADC1CONIF_1_CON_IF1_MASK    2U
    #define ADC1CONIF_1_CON_IF2_MASK    4U
    #define ADC1CONIF_1_CON_IF3_MASK    8U
    #define ADC1CONIF_1_CON_IF4_MASK    16U
    #define ADC1CONIF_1_CON_IF5_MASK    32U
    #define ADC1CONIF_1_CON_IF6_MASK    64U
    #define ADC1CONIF_1_CON_IF7_MASK    128U
    #define ADC1CONIF_1_CON_IF_1_MASK   254U
    #define ADC1CONIF_1_CON_IF_1_BITNUM 1U
    
  } Overlap_STR;

  struct {
    word EOL_IF      :1;                                       /* End Of List Interrupt Flag */
    word CON_IF1     :1;                                       /* Conversion Interrupt 1 Flag */
    word CON_IF2     :1;                                       /* Conversion Interrupt 2 Flag */
    word CON_IF3     :1;                                       /* Conversion Interrupt 3 Flag */
    word CON_IF4     :1;                                       /* Conversion Interrupt 4 Flag */
    word CON_IF5     :1;                                       /* Conversion Interrupt 5 Flag */
    word CON_IF6     :1;                                       /* Conversion Interrupt 6 Flag */
    word CON_IF7     :1;                                       /* Conversion Interrupt 7 Flag */
    word CON_IF8     :1;                                       /* Conversion Interrupt 8 Flag */
    word CON_IF9     :1;                                       /* Conversion Interrupt 9 Flag */
    word CON_IF10    :1;                                       /* Conversion Interrupt 10 Flag */
    word CON_IF11    :1;                                       /* Conversion Interrupt 11 Flag */
    word CON_IF12    :1;                                       /* Conversion Interrupt 12 Flag */
    word CON_IF13    :1;                                       /* Conversion Interrupt 13 Flag */
    word CON_IF14    :1;                                       /* Conversion Interrupt 14 Flag */
    word CON_IF15    :1;                                       /* Conversion Interrupt 15 Flag */
  } Bits;
  struct {
    word         :1;
    word grpCON_IF_1 :15;
  } MergedBits;
} ADC1CONIFSTR;
extern volatile ADC1CONIFSTR _ADC1CONIF @0x0000064C;
#define ADC1CONIF                       _ADC1CONIF.Word
#define ADC1CONIF_EOL_IF                _ADC1CONIF.Bits.EOL_IF
#define ADC1CONIF_CON_IF1               _ADC1CONIF.Bits.CON_IF1
#define ADC1CONIF_CON_IF2               _ADC1CONIF.Bits.CON_IF2
#define ADC1CONIF_CON_IF3               _ADC1CONIF.Bits.CON_IF3
#define ADC1CONIF_CON_IF4               _ADC1CONIF.Bits.CON_IF4
#define ADC1CONIF_CON_IF5               _ADC1CONIF.Bits.CON_IF5
#define ADC1CONIF_CON_IF6               _ADC1CONIF.Bits.CON_IF6
#define ADC1CONIF_CON_IF7               _ADC1CONIF.Bits.CON_IF7
#define ADC1CONIF_CON_IF8               _ADC1CONIF.Bits.CON_IF8
#define ADC1CONIF_CON_IF9               _ADC1CONIF.Bits.CON_IF9
#define ADC1CONIF_CON_IF10              _ADC1CONIF.Bits.CON_IF10
#define ADC1CONIF_CON_IF11              _ADC1CONIF.Bits.CON_IF11
#define ADC1CONIF_CON_IF12              _ADC1CONIF.Bits.CON_IF12
#define ADC1CONIF_CON_IF13              _ADC1CONIF.Bits.CON_IF13
#define ADC1CONIF_CON_IF14              _ADC1CONIF.Bits.CON_IF14
#define ADC1CONIF_CON_IF15              _ADC1CONIF.Bits.CON_IF15
#define ADC1CONIF_CON_IF_1              _ADC1CONIF.MergedBits.grpCON_IF_1
#define ADC1CONIF_CON_IF                ADC1CONIF_CON_IF_1

#define ADC1CONIF_EOL_IF_MASK           1U
#define ADC1CONIF_CON_IF1_MASK          2U
#define ADC1CONIF_CON_IF2_MASK          4U
#define ADC1CONIF_CON_IF3_MASK          8U
#define ADC1CONIF_CON_IF4_MASK          16U
#define ADC1CONIF_CON_IF5_MASK          32U
#define ADC1CONIF_CON_IF6_MASK          64U
#define ADC1CONIF_CON_IF7_MASK          128U
#define ADC1CONIF_CON_IF8_MASK          256U
#define ADC1CONIF_CON_IF9_MASK          512U
#define ADC1CONIF_CON_IF10_MASK         1024U
#define ADC1CONIF_CON_IF11_MASK         2048U
#define ADC1CONIF_CON_IF12_MASK         4096U
#define ADC1CONIF_CON_IF13_MASK         8192U
#define ADC1CONIF_CON_IF14_MASK         16384U
#define ADC1CONIF_CON_IF15_MASK         32768U
#define ADC1CONIF_CON_IF_1_MASK         65534U
#define ADC1CONIF_CON_IF_1_BITNUM       1U


/*** ADC1IMDRI - ADC1 Intermediate Result Information Register; 0x0000064E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ADC1IMDRI_0 - ADC1 Intermediate Result Information Register 0; 0x0000064E ***/
    union {
      byte Byte;
      struct {
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte RVL_IMD     :1;                                       /* Active RVL At Intermediate Event */
        byte CSL_IMD     :1;                                       /* Active CSL At Intermediate Event */
      } Bits;
    } ADC1IMDRI_0STR;
    #define ADC1IMDRI_0                 _ADC1IMDRI.Overlap_STR.ADC1IMDRI_0STR.Byte
    #define ADC1IMDRI_0_RVL_IMD         _ADC1IMDRI.Overlap_STR.ADC1IMDRI_0STR.Bits.RVL_IMD
    #define ADC1IMDRI_0_CSL_IMD         _ADC1IMDRI.Overlap_STR.ADC1IMDRI_0STR.Bits.CSL_IMD
    /* ADC1IMDRI__ARR: Access 2 ADC1IMDRI_x registers in an array */
    #define ADC1IMDRI__ARR              ((volatile byte *) &ADC1IMDRI_0)
    
    #define ADC1IMDRI_0_RVL_IMD_MASK    64U
    #define ADC1IMDRI_0_CSL_IMD_MASK    128U
    

    /*** ADC1IMDRI_1 - ADC1 Intermediate Result Information Register 1; 0x0000064F ***/
    union {
      byte Byte;
      struct {
        byte RIDX_IMD    :6;                                       /* RES_IDX Value At Intermediate Event */
        byte             :1; 
        byte             :1; 
      } Bits;
    } ADC1IMDRI_1STR;
    #define ADC1IMDRI_1                 _ADC1IMDRI.Overlap_STR.ADC1IMDRI_1STR.Byte
    #define ADC1IMDRI_1_RIDX_IMD        _ADC1IMDRI.Overlap_STR.ADC1IMDRI_1STR.Bits.RIDX_IMD
    
    #define ADC1IMDRI_1_RIDX_IMD_MASK   63U
    #define ADC1IMDRI_1_RIDX_IMD_BITNUM 0U
    
  } Overlap_STR;

