phidiawang/Wisemay_CoolingFang_V2.0/src/S12ZVM_system/peripherals/mc9s12zvml32.h
extern volatile ADC1CROFF0STR _ADC1CROFF0 @0x00000664;
#define ADC1CROFF0                      _ADC1CROFF0.Byte
#define ADC1CROFF0_CMDRES_OFF0          _ADC1CROFF0.Bits.CMDRES_OFF0
/* ADC1CROFF_ARR: Access 2 ADC1CROFFx registers in an array */
#define ADC1CROFF_ARR                   ((volatile byte *) &ADC1CROFF0)

#define ADC1CROFF0_CMDRES_OFF0_MASK     127U
#define ADC1CROFF0_CMDRES_OFF0_BITNUM   0U


/*** ADC1CROFF1 - ADC1 Command and Result Offset Register 1; 0x00000665 ***/
typedef union {
  byte Byte;
  struct {
    byte CMDRES_OFF1 :7;                                       /* ADC Command and Result Offset Value refer to CSL_1 and RVL_1 */
    byte             :1; 
  } Bits;
} ADC1CROFF1STR;
extern volatile ADC1CROFF1STR _ADC1CROFF1 @0x00000665;
#define ADC1CROFF1                      _ADC1CROFF1.Byte
#define ADC1CROFF1_CMDRES_OFF1          _ADC1CROFF1.Bits.CMDRES_OFF1

#define ADC1CROFF1_CMDRES_OFF1_MASK     127U
#define ADC1CROFF1_CMDRES_OFF1_BITNUM   0U


/*** GDUE - GDU Module Enable Register; 0x000006A0 ***/
typedef union {
  byte Byte;
  struct {
    byte GFDE        :1;                                       /* GDU FET Pre-Driver Enable */
    byte GCPE        :1;                                       /* GDU Charge Pump Enable */
    byte GCSE0       :1;                                       /* GDU Current Sense Amplifier 0 Enable */
    byte GBOE        :1;                                       /* GDU Boost Converter Enable */
    byte GCSE1       :1;                                       /* GDU Current Sense Amplifier 1 Enable */
    byte             :1; 
    byte             :1; 
    byte GWP         :1;                                       /* GDU Write Protect */
  } Bits;
} GDUESTR;
extern volatile GDUESTR _GDUE @0x000006A0;
#define GDUE                            _GDUE.Byte
#define GDUE_GFDE                       _GDUE.Bits.GFDE
#define GDUE_GCPE                       _GDUE.Bits.GCPE
#define GDUE_GCSE0                      _GDUE.Bits.GCSE0
#define GDUE_GBOE                       _GDUE.Bits.GBOE
#define GDUE_GCSE1                      _GDUE.Bits.GCSE1
#define GDUE_GWP                        _GDUE.Bits.GWP

#define GDUE_GFDE_MASK                  1U
#define GDUE_GCPE_MASK                  2U
#define GDUE_GCSE0_MASK                 4U
#define GDUE_GBOE_MASK                  8U
#define GDUE_GCSE1_MASK                 16U
#define GDUE_GWP_MASK                   128U


/*** GDUCTR - GDU Control Register; 0x000006A1 ***/
typedef union {
  byte Byte;
  struct {
    byte GBKTIM1     :2;                                       /* GDU Blanking Time */
    byte GBKTIM2     :4;                                       /* GDU Blanking Time */
    byte             :1; 
    byte GHHDLVL     :1;                                       /* GDU High HD Level Select */
  } Bits;
} GDUCTRSTR;
extern volatile GDUCTRSTR _GDUCTR @0x000006A1;
#define GDUCTR                          _GDUCTR.Byte
#define GDUCTR_GBKTIM1                  _GDUCTR.Bits.GBKTIM1
#define GDUCTR_GBKTIM2                  _GDUCTR.Bits.GBKTIM2
#define GDUCTR_GHHDLVL                  _GDUCTR.Bits.GHHDLVL

#define GDUCTR_GBKTIM1_MASK             3U
#define GDUCTR_GBKTIM1_BITNUM           0U
#define GDUCTR_GBKTIM2_MASK             60U
#define GDUCTR_GBKTIM2_BITNUM           2U
#define GDUCTR_GHHDLVL_MASK             128U


/*** GDUIE - GDU Interrupt Enable Register; 0x000006A2 ***/
typedef union {
  byte Byte;
  struct {
    byte GLVLSIE     :1;                                       /* GDU Low VLS Interrupt Enable */
    byte GHHDIE      :1;                                       /* GDU High HD Interrupt Enable */
    byte GDSEIE      :1;                                       /* GDU Desaturation Error Interrupt Enable */
    byte GOCIE0      :1;                                       /* GDU Overcurrent Interrupt Enable 0 */
    byte GOCIE1      :1;                                       /* GDU Overcurrent Interrupt Enable 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpGOCIE :2;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} GDUIESTR;
extern volatile GDUIESTR _GDUIE @0x000006A2;
#define GDUIE                           _GDUIE.Byte
#define GDUIE_GLVLSIE                   _GDUIE.Bits.GLVLSIE
#define GDUIE_GHHDIE                    _GDUIE.Bits.GHHDIE
#define GDUIE_GDSEIE                    _GDUIE.Bits.GDSEIE
#define GDUIE_GOCIE0                    _GDUIE.Bits.GOCIE0
#define GDUIE_GOCIE1                    _GDUIE.Bits.GOCIE1
#define GDUIE_GOCIE                     _GDUIE.MergedBits.grpGOCIE

#define GDUIE_GLVLSIE_MASK              1U
#define GDUIE_GHHDIE_MASK               2U
#define GDUIE_GDSEIE_MASK               4U
#define GDUIE_GOCIE0_MASK               8U
#define GDUIE_GOCIE1_MASK               16U
#define GDUIE_GOCIE_MASK                24U
#define GDUIE_GOCIE_BITNUM              3U


/*** GDUDSE - GDU Desaturation Error Flag Register; 0x000006A3 ***/
typedef union {
  byte Byte;
  struct {
    byte GDLSIF0     :1;                                       /* Low-side desaturation error flag for channel 0 */
    byte GDLSIF1     :1;                                       /* Low-side desaturation error flag for channel 1 */
    byte GDLSIF2     :1;                                       /* Low-side desaturation error flag for channel 2 */
    byte             :1; 
    byte GDHSIF0     :1;                                       /* High-side desaturation error flag for channel 0 */
    byte GDHSIF1     :1;                                       /* High-side desaturation error flag for channel 1 */
    byte GDHSIF2     :1;                                       /* High-side desaturation error flag for channel 2 */
    byte             :1; 
  } Bits;
  struct {
    byte grpGDLSIF :3;
    byte         :1;
    byte grpGDHSIF :3;
    byte         :1;
  } MergedBits;
} GDUDSESTR;
extern volatile GDUDSESTR _GDUDSE @0x000006A3;
#define GDUDSE                          _GDUDSE.Byte
#define GDUDSE_GDLSIF0                  _GDUDSE.Bits.GDLSIF0
#define GDUDSE_GDLSIF1                  _GDUDSE.Bits.GDLSIF1
#define GDUDSE_GDLSIF2                  _GDUDSE.Bits.GDLSIF2
#define GDUDSE_GDHSIF0                  _GDUDSE.Bits.GDHSIF0
#define GDUDSE_GDHSIF1                  _GDUDSE.Bits.GDHSIF1
#define GDUDSE_GDHSIF2                  _GDUDSE.Bits.GDHSIF2
#define GDUDSE_GDLSIF                   _GDUDSE.MergedBits.grpGDLSIF
#define GDUDSE_GDHSIF                   _GDUDSE.MergedBits.grpGDHSIF

