phidiawang/Wisemay_CoolingFang_V2.0/src/S12ZVM_system/peripherals/mc9s12zvml32.h
#define GDUDSE_GDLSIF0_MASK             1U
#define GDUDSE_GDLSIF1_MASK             2U
#define GDUDSE_GDLSIF2_MASK             4U
#define GDUDSE_GDHSIF0_MASK             16U
#define GDUDSE_GDHSIF1_MASK             32U
#define GDUDSE_GDHSIF2_MASK             64U
#define GDUDSE_GDLSIF_MASK              7U
#define GDUDSE_GDLSIF_BITNUM            0U
#define GDUDSE_GDHSIF_MASK              112U
#define GDUDSE_GDHSIF_BITNUM            4U


/*** GDUSTAT - GDU Status Register; 0x000006A4 ***/
typedef union {
  byte Byte;
  struct {
    byte GLVLSS      :1;                                       /* GDU Low VLS Status */
    byte GHHDS       :1;                                       /* GDU High HD Supply Status */
    byte             :1; 
    byte GOCS0       :1;                                       /* GDU Overcurrent Status 0 */
    byte GOCS1       :1;                                       /* GDU Overcurrent Status 1 */
    byte GPHS0       :1;                                       /* GDU Phase Status 0 */
    byte GPHS1       :1;                                       /* GDU Phase Status 1 */
    byte GPHS2       :1;                                       /* GDU Phase Status 2 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpGOCS :2;
    byte grpGPHS :3;
  } MergedBits;
} GDUSTATSTR;
extern volatile GDUSTATSTR _GDUSTAT @0x000006A4;
#define GDUSTAT                         _GDUSTAT.Byte
#define GDUSTAT_GLVLSS                  _GDUSTAT.Bits.GLVLSS
#define GDUSTAT_GHHDS                   _GDUSTAT.Bits.GHHDS
#define GDUSTAT_GOCS0                   _GDUSTAT.Bits.GOCS0
#define GDUSTAT_GOCS1                   _GDUSTAT.Bits.GOCS1
#define GDUSTAT_GPHS0                   _GDUSTAT.Bits.GPHS0
#define GDUSTAT_GPHS1                   _GDUSTAT.Bits.GPHS1
#define GDUSTAT_GPHS2                   _GDUSTAT.Bits.GPHS2
#define GDUSTAT_GOCS                    _GDUSTAT.MergedBits.grpGOCS
#define GDUSTAT_GPHS                    _GDUSTAT.MergedBits.grpGPHS

#define GDUSTAT_GLVLSS_MASK             1U
#define GDUSTAT_GHHDS_MASK              2U
#define GDUSTAT_GOCS0_MASK              8U
#define GDUSTAT_GOCS1_MASK              16U
#define GDUSTAT_GPHS0_MASK              32U
#define GDUSTAT_GPHS1_MASK              64U
#define GDUSTAT_GPHS2_MASK              128U
#define GDUSTAT_GOCS_MASK               24U
#define GDUSTAT_GOCS_BITNUM             3U
#define GDUSTAT_GPHS_MASK               224U
#define GDUSTAT_GPHS_BITNUM             5U


/*** GDUSRC - GDU Slew Rate Control Register; 0x000006A5 ***/
typedef union {
  byte Byte;
  struct {
    byte GSRCLS0     :1;                                       /* This bit controls the slew rate on the LG0 */
    byte GSRCLS1     :1;                                       /* This bit controls the slew rate on the LG1 */
    byte GSRCLS2     :1;                                       /* This bit controls the slew rate on the LG2 */
    byte             :1; 
    byte GSRCHS0     :1;                                       /* This bit controls the slew rate on the HG0 */
    byte GSRCHS1     :1;                                       /* This bit controls the slew rate on the HG1 */
    byte GSRCHS2     :1;                                       /* This bit controls the slew rate on the HG2 */
    byte             :1; 
  } Bits;
  struct {
    byte grpGSRCLS :3;
    byte         :1;
    byte grpGSRCHS :3;
    byte         :1;
  } MergedBits;
} GDUSRCSTR;
extern volatile GDUSRCSTR _GDUSRC @0x000006A5;
#define GDUSRC                          _GDUSRC.Byte
#define GDUSRC_GSRCLS0                  _GDUSRC.Bits.GSRCLS0
#define GDUSRC_GSRCLS1                  _GDUSRC.Bits.GSRCLS1
#define GDUSRC_GSRCLS2                  _GDUSRC.Bits.GSRCLS2
#define GDUSRC_GSRCHS0                  _GDUSRC.Bits.GSRCHS0
#define GDUSRC_GSRCHS1                  _GDUSRC.Bits.GSRCHS1
#define GDUSRC_GSRCHS2                  _GDUSRC.Bits.GSRCHS2
#define GDUSRC_GSRCLS                   _GDUSRC.MergedBits.grpGSRCLS
#define GDUSRC_GSRCHS                   _GDUSRC.MergedBits.grpGSRCHS

#define GDUSRC_GSRCLS0_MASK             1U
#define GDUSRC_GSRCLS1_MASK             2U
#define GDUSRC_GSRCLS2_MASK             4U
#define GDUSRC_GSRCHS0_MASK             16U
#define GDUSRC_GSRCHS1_MASK             32U
#define GDUSRC_GSRCHS2_MASK             64U
#define GDUSRC_GSRCLS_MASK              7U
#define GDUSRC_GSRCLS_BITNUM            0U
#define GDUSRC_GSRCHS_MASK              112U
#define GDUSRC_GSRCHS_BITNUM            4U


/*** GDUF - GDU Flag Register; 0x000006A6 ***/
typedef union {
  byte Byte;
  struct {
    byte GLVLSIF     :1;                                       /* GDU Low VLS Supply Interrupt Flag */
    byte GHHDIF      :1;                                       /* GDU High VHD Supply Interrupt Flag */
    byte             :1; 
    byte GOCIF0      :1;                                       /* GDU Overcurrent Interrupt Flag 0 */
    byte GOCIF1      :1;                                       /* GDU Overcurrent Interrupt Flag 1 */
    byte GLVLSF      :1;                                       /* GDU Low VLS Supply Flag */
    byte GHHDF       :1;                                       /* GDU High VHD Supply Flag */
    byte GSUF        :1;                                       /* GDU Start-up Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpGOCIF :2;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} GDUFSTR;
extern volatile GDUFSTR _GDUF @0x000006A6;
#define GDUF                            _GDUF.Byte
#define GDUF_GLVLSIF                    _GDUF.Bits.GLVLSIF
#define GDUF_GHHDIF                     _GDUF.Bits.GHHDIF
#define GDUF_GOCIF0                     _GDUF.Bits.GOCIF0
#define GDUF_GOCIF1                     _GDUF.Bits.GOCIF1
#define GDUF_GLVLSF                     _GDUF.Bits.GLVLSF
#define GDUF_GHHDF                      _GDUF.Bits.GHHDF
#define GDUF_GSUF                       _GDUF.Bits.GSUF
#define GDUF_GOCIF                      _GDUF.MergedBits.grpGOCIF

#define GDUF_GLVLSIF_MASK               1U
#define GDUF_GHHDIF_MASK                2U
#define GDUF_GOCIF0_MASK                8U
#define GDUF_GOCIF1_MASK                16U
#define GDUF_GLVLSF_MASK                32U
#define GDUF_GHHDF_MASK                 64U
#define GDUF_GSUF_MASK                  128U
#define GDUF_GOCIF_MASK                 24U
#define GDUF_GOCIF_BITNUM               3U


